rails/app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <br>
    <% current_user =  User.find_by(id: session[:user_id])%>