rails/app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "ninnka@ie.com"], ["LIMIT", 1]]
---
  def create
    #debugger
    #user = User.find_by(name: params[:session][:name].downcase)
    user = User.find_by(name: params[:name].downcase)
    #debugger
    user.login_status = 1
    user.save
    render 'new'

    """
    user = User.find_by(email: params[:session][:email].downcase)