rails/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def correct_user
    @user = User.find(params[:id]) #postされたユーザの情報をデータベースから取ってくる
    unless @user == User.find_by(id: session[:user_id]) # 現在ログインしているユーザ と post(ユーザのページを見たい)　が違うか確認